documents/Learning GNU Emacs 3rd/chapter02/chapter2.4.org
#+title: 2.4. Emacs和剪切板

Emacs 21 可以很好的支持剪切板，尽管它并不能每次都按你想要的方式工作。
现在来进一步介绍些细节。

*2.4.1 将文本存到剪切板*

一般情况下，使用工具栏的剪切或复制图标或者选项中的编辑菜单会将文本保存
到剪切板并且可以被其他程序访问。

不幸的是，Emacs在这个问题上不同平台有所区别。大部分平台特性会在第13章
介绍，但是剪切和粘贴这种至关重要的操作必须要先介绍一下。

在Windows和Mac OS X (不包括Linux）中，用 *C-w* 剪切或者 *M-w* 复制也会
将文本放到剪切板中。

在Windows和Mac OS X中，只要用鼠标选择文本就可以将其存入剪切板（不能
在Linux中使用）。大部分编辑器要先高亮文本，再执行拷贝指令，Emacs却不用。
表2-6显示Emacs在不同平台如何工作的。

#+Caption: *表2-6.用鼠标选择文本*
|   |                 | linux | Windows | Mac OS X graphical | Mac OS X terminal |
|---+-----------------+-------+---------+--------------------+-------------------|
| / | <>              | <>    | <>      | <>                 | <>                |
|---+-----------------+-------+---------+--------------------+-------------------|
| # | 发送到剪切板 | 否   | 是     | 是                | 否[fn:1]                |
|---+-----------------+-------+---------+--------------------+-------------------|
| # | 发送到Kill Ring | 是    | 是      | 是                 | 否                |

在Linux中将文本保存到剪切板，先用鼠标选择（或者标记区域），然后按工具
栏的剪切或复制按钮或者菜单栏选项。你可以用表2-7列出的在不同平台上都可
使用的剪切板特殊命令。

*2.4.2 重新得到剪切板中的文本*

如刚才介绍的，在其他应用程序中，一般执行剪切和粘贴前要先选择文本再执行
复制命令。那么如何粘贴到Emacs中呢？

毫无疑问，用工具栏的粘贴按钮或者编辑菜单里的相关功能就可以完成这些操作
（见表2-7；Mac OS X 上的Emacs禁用了图标以及菜单选项；不过，相关功能
*clipboard-yank* 可以完成此功能）。 *C-y* 也可以插入剪切板的文本。此
外，一个简单的鼠标操作可以在大部分平台使用。在Emacs窗口中，单击鼠标中
键或者滚轮就可以从剪切板粘贴文本。当然，你的鼠标必须有中键。

#+CAPTION: *表2-7. 从剪切板粘贴*
|   |                            | Linux | Windows | Mac OS X graphical | Mac OS X terminal |
|---+----------------------------+-------+---------+--------------------+-------------------|
| / | <>                         | <>    | <>      | <>                 | <>                |
|---+----------------------------+-------+---------+--------------------+-------------------|
| # | *C-y* 粘贴?                | yes   | yes     | yes                | no[fn:2]          |
|---+----------------------------+-------+---------+--------------------+-------------------|
| # | 工具栏粘贴?                | yes   | yes     | no                 | no                |
|---+----------------------------+-------+---------+--------------------+-------------------|
| # | 编辑菜单粘贴选项?          | yes   | yes     | no                 | no                |
|---+----------------------------+-------+---------+--------------------+-------------------|
| # | 鼠标中键粘贴?              | yes   | yes     | yse                | no                |
|---+----------------------------+-------+---------+--------------------+-------------------|
| # | *M-x clipboard-yank* 粘贴? | yes   | yes     | yse                | no                |
 
另一个关于剪切和粘贴的问题就是编码格式。编码格式是Emacs中一个复杂的问
题；Emacs 22支持全编码功能被人们所诟病。在这个问题上，我们仅向你介绍一
个变量用于解决剪切和粘贴相关的编码问题： *set-clipboard-coding-system*.

如果你喜欢用剪切板，可以修改Emacs的剪切和粘贴快捷键为更常用的 *C-x*，
*C-c* ,和 *C-v* 。见本章后面的“让EMacs按你的方式工作”的详细介绍。

表 2-8 总结了剪切板相关指令。

#+CAPTION: *表2-8 剪切b板指令*
|   | 快捷键 | 命令名                     | 功能                                 |
|---+--------+----------------------------+--------------------------------------|
| / | <>     | <>                         | <>                                   |
|---+--------+----------------------------+--------------------------------------|
| # | 无     | *clipboard-kill-region*    | 剪切区域同时保存到杀戮环和系统剪切板 |
|---+--------+----------------------------+--------------------------------------|
| # | 无     | *clipboard-yank*           | 从剪切板粘贴文本                     |
|---+--------+----------------------------+--------------------------------------|
| # | 无     | *clipboard-kill-ring-save* | 复制文本到剪切板                             |
 
* Footnotes

[fn:1] 可能通过先选择文本再按 *xxxMacSymxxx-C* 来完成此操作。只是选择文本并不能
复制到剪切板。
[fn:2] *xxxMacSymxxx-v* 从剪切板粘贴文本。


